import './App.css'

// для створення компонента зазвичай в 95% випадків пишеться функція
function App() {
    // таким рядком робиться так званий "СТАН" компонента
    // для читання стану використовується константа "count"
    // для змінних стану буде функція setCount
    // useState - хук для створення одного зі станів, у дужках іде початкове значення
    // стан може бути для будь-якого типу
    // функціональні - на функціях
    // класові - на класах
    // */}
    // коментар усередині JSX

    return (
        <h1>12341234</h1>
    )
}

export default App